# AnalyticalVisualLightTransmittance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalVisualLightTransmittance Property
ParameterTypeId Class See Also
---
"Visual Light Transmittance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalVisualLightTransmittance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalVisualLightTransmittance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalVisualLightTransmittance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace